# Создайте файл `lesson_3_task_3.py`.
# Импортируйте классы `Address` и `Mailing`.
# В файле создайте экземпляр класса `Mailing`.
# Заполните поля класса адресами (`to_address` и `from_address`), трек-номером (`track`) и стоимостью (`cost`).
# Распечатайте в консоль отправление в формате: `Отправление <track> из <индекс>, <город>, <улица>, <дом> - <квартира> в <индекс>, <город>, <улица>, <дом> -<квартира>. Стоимость <стоимость> рублей.`.
# Все данные должны получаться из экземпляра `Mailing`.

from Address import Address
from Mailing import Mailing

#доделать !
